
/**
  ******************************************************************************
  * @file    HD_systick.c
  * @author  Helone
  * @version V1.0
  * @date    2018-7-10
  * @brief   通过系统的滴答定时器进行精准的毫秒/微妙级延时
  ******************************************************************************
	* @attention:
	*文件工程使用 KEIL4.72编写 
	*源代码文字编码使用 ANSI  or   UTF-8 without signature， 
	*当出现乱码时在 Edit->Configuration->Editor->Encoding 下修改
  */

#include "systick.h"

/*******************************************************************************
* 功能: 微妙延时
* 参数: 
*		i: 每个数代表以微妙
* 返回: none
*******************************************************************************/
void delay_us(u32 i)
{
	u32 temp;
	SysTick->LOAD=9*i;		 //设置重装数值, 72MHZ时
	SysTick->CTRL=0X01;		 //使能，减到零是无动作，采用外部时钟源
	SysTick->VAL=0;		   	 //清零计数器
	do
	{
		temp=SysTick->CTRL;		   //读取当前倒计数值
	}
	while((temp&0x01)&&(!(temp&(1<<16))));	 //等待时间到达
	SysTick->CTRL=0;	//关闭计数器
	SysTick->VAL=0;		//清空计数器
}
/*******************************************************************************
* 功能: 毫妙延时
* 参数: 
*		i: 每个数代表以毫妙
* 返回: none
*******************************************************************************/
void delay_ms(u32 i)
{
	u32 temp;
	SysTick->LOAD=9000*i;	  //设置重装数值, 72MHZ时
	SysTick->CTRL=0X01;		//使能，减到零是无动作，采用外部时钟源
	SysTick->VAL=0;			//清零计数器
	do
	{
		temp=SysTick->CTRL;	   //读取当前倒计数值
	}
	while((temp&0x01)&&(!(temp&(1<<16))));	//等待时间到达
	SysTick->CTRL=0;	//关闭计数器
	SysTick->VAL=0;		//清空计数器
}
